/*
*********************************************************************************************************
*
*   模块名称 : STM32H7驱动液晶
*   文件名称 : bsp_tft_h7.h
*   版    本 : V2.0
*   说    明 : 头文件
*
*   Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _BSP_TFT_H7_H
#define _BSP_TFT_H7_H

/* 包含头文件 ----------------------------------------------------------------*/

/* 类型定义 ------------------------------------------------------------------*/
typedef struct
{
    char *name;
    uint16_t pwidth;  // LCD面板的宽度,固定参数,不随显示方向改变,如果为0,说明没有任何RGB屏接入
    uint16_t pheight; // LCD面板的高度,固定参数,不随显示方向改变
    uint16_t hsw;     // 水平同步宽度
    uint16_t vsw;     // 垂直同步宽度
    uint16_t hbp;     // 水平后廊
    uint16_t vbp;     // 垂直后廊
    uint16_t hfp;     // 水平前廊
    uint16_t vfp;     // 垂直前廊
} tft_cfg_t;

/* 宏定义 --------------------------------------------------------------------*/

/* 扩展变量 ------------------------------------------------------------------*/

/* 函数声明 ------------------------------------------------------------------*/

void bsp_InitTFT(void);
char *TFT_GetDescribe(void);
void TFT_DispOn(void);
void TFT_DispOff(void);

#endif
