/*
*********************************************************************************************************
*
*    模块名称 : DMA驱动
*    文件名称 : bsp_dma.h
*    版    本 : V1.0
*    说    明 : ADC多通道采样
*              1. xxx
*
*    修改记录 :
*        版本号  日期        作者     说明
*        V1.0    2018-12-12 armfly  正式发布
*
*    Copyright (C), 2018-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __BSP_DMA_H
#define __BSP_DMA_H

/* 供外部调用的变量声明 */

/* 供外部调用的函数声明 */
void bsp_Init_dma(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
